Добавлен подсчет опыта до ближайшего апа
Исправлена транслитерация ников в чате
Исправлено автоматичское обновление фреймов игроков/найденного в лабиринте
Убрано скрытие кнопок вверх/вниз на форуме
Добавлена фокусировка на поле ввода цифр на ресурсных и производственных локациях
Добавлено подтверждение кнопкой Enter на ресурсных и производственных локациях
Добавлена возможность группировки ресурсов и подарков в рюкзаке
Добавлены ссылки на персонажей в некоторых системных сообщениях
Исправлена функция "статы полосками" в информации об игроке
Убраны галочки в настройках для "живых таймеров", "ссылки с колец, подарков"
Добавлен подсчет дукатов при продаже всех ресурсов в скупочном магазине
В подарочном магазине добавлена возможность выбрать количество подарков